Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CMS8C_0.xml
        <register caption="Channel Data Register 5" name="ADC_CDR5" offset="0x64" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 6" name="ADC_CDR6" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 7" name="ADC_CDR7" offset="0x6C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Internal Reference Voltage Change Enable" mask="0x00000004" name="IRVCE" values="ADC_ACR__IRVCE"/>
          <bitfield caption="Internal Reference Voltage Selection" mask="0x00000078" name="IRVS"/>
          <bitfield caption="Force Internal Reference Voltage" mask="0x00080000" name="FORCEREF"/>
          <bitfield caption="Internal Voltage Reference ON" mask="0x00100000" name="ONREF"/>
        </register>
        <register caption="Write Protection Mode Register" name="ADC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect Key" mask="0xFFFFFF00" name="WPKEY" values="ADC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ADC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="ADC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="ADC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="ADC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="ADC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="ADC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="ADC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="ADC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__TRGSEL">
        <value caption="-" name="ADC_TRIG0" value="0x0"/>
        <value caption="Timer Counter Channel 0 Output" name="ADC_TRIG1" value="0x1"/>
        <value caption="Timer Counter Channel  1 Output" name="ADC_TRIG2" value="0x2"/>
        <value caption="Timer Counter Channel  2 Output" name="ADC_TRIG3" value="0x3"/>
        <value caption="Timer Counter Channel  3 Output" name="ADC_TRIG4" value="0x4"/>
        <value caption="Timer Counter Channel  4 Output" name="ADC_TRIG5" value="0x5"/>
        <value caption="Timer Counter Channel  5 Output" name="ADC_TRIG6" value="0x6"/>
      </value-group>
      <value-group caption="" name="ADC_MR__LOWRES">
        <value caption="10-bit resolution. For higher resolution by averaging, please refer to Section 8.15 &#34;ADC Extended Mode Register&#34;" name="BITS_10" value="0"/>
        <value caption="8-bit resolution" name="BITS_8" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SLEEP">
        <value caption="Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions" name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The ADC core and reference voltage circuitry are OFF between conversions" name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FREERUN">
        <value caption="Normal Mode" name="OFF" value="0"/>
        <value caption="Free Run Mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCClock" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCClock" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCClock" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCClock" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCClock" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCClock" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCClock" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCClock" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCClock" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCClock" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCClock" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCClock" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCClock" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCClock" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCClock" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCClock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 and can be used to convert the same channel several times." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_TEMPMR__TEMPCMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
